src/Catalogs/ТипыЗадачСборДампов/ТипыЗадачСборДампов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыЗадачСборДампов</name>
  <predefined>
    <items>
      <name>КаталогЛоговЗавершившегосяПроцессаПуст</name>
      <description>Каталог логов завершившегося процесса пуст</description>
    </items>
    <items>
      <name>НеНайденТЖ</name>
      <description>Не найден технологический журнал для файла дампа</description>
    </items>
    <items>
      <name>НеУдаляетсяДамп</name>
      <description>Не удаляется дамп</description>
    </items>
    <items>
      <name>ПустойФайлЛогов</name>
      <description>Обнаружен пустой файл технологического журнала завершившегося рабочего процесса</description>
    </items>
    <items>
      <name>ОшибкаПриОбработкеДампа</name>
      <description>Ошибка при обработке дампа</description>
    </items>
    <items>
      <name>СборДамповИсправленныйДампПересмотреть</name>
      <description>Пересмотреть ошибки по дампу памяти</description>
    </items>
    <items>
      <name>ПроцессЗавершилсяБезДампа</name>
      <description>Процесс завершился без образования дампа</description>
    </items>
    <items>
      <name>СборДамповНовыйДампРассмотреть</name>
      <description>Рассмотреть ошибки по дампу памяти</description>
    </items>
  </predefined>
  <attributes>
    <name>ОповещатьПриКаждомИнциденте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПериодОповещенияСек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПриВыполнении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйТекстПредупреждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПервойРегистрации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ТипыЗадачСборДампов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПолучитьОсновнойШаблон(Команда)
	Объект.ДополнительныйТекстПредупреждения = ПолучитьОсновнойШаблонНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОсновнойШаблонНаСервере(Ссылка)
	Если Ссылка = Справочники.ТипыЗадачСборДампов.СборДамповНовыйДампРассмотреть Тогда
		Возврат Справочники.ТипыЗадачСборДампов.ПолучитьОсновнойШаблонНовыйДампРассмотреть();
	ИначеЕсли Ссылка = Справочники.ТипыЗадачСборДампов.КаталогЛоговЗавершившегосяПроцессаПуст Тогда
		Возврат Справочники.ТипыЗадачСборДампов.ПолучитьОсновнойШаблонКаталогЛоговЗавершившегосяПроцессаПуст();
	КонецЕсли;
КонецФункции
